## User Journey การเดินทางของ User

User เดินทางไปไหน แล้วเราจะต้องรู้ไปทำไม วันนี้เราจะมาหาคำตอบกัน

.

.



User Journey เป็นอีกหนึ่งเครื่องมือที่นิยมใช้กันมานานแล้ว เพื่อน ๆ อาจจะเคยได้ยินในวงการ Marketing ด้วยชื่อ Customer Journey หรือ การเดินทางของลูกค้า ซึ่งก็คล้าย ๆ กันกับของเรา แต่ใน User Journey ของเราจะเน้นไปที่ User ที่ใช้งาน Digital Product นั่นเอง

**แล้ว User Journey จะช่วยทีม Product ยังไง ?**

ช่วยแน่นอน เพราะ User journey ช่วยให้เราเห็นภาพใหญ่ของ User ที่มีปฏิสัมพันธ์ (Interact) กับ Product ไม่ว่าจะเป็น ก่อน ระหว่าง และหลัง การมีปฏิสัมพันธ์กับ Product ของเรา

ซึ่งจะทำให้ทีมเห็นโอกาส (Opportunity) ในการสร้าง หรือพัฒนา Product ไม่ว่าจะเป็นการสร้าง Product ใหม่ ออก Feature ใหม่ รวมไปถึงการพัฒนา Feature ที่มีอยู่แล้วให้ตอบโจทย์กับ User 

---

### User Journey เหมาะกับการใช้งานตอนไหน ?

**1.ก่อนสร้าง Product**

เพื่อหาจุดที่ทีมจะสามารถแก้ปัญหาของ User ใน Touch Point ต่าง ๆ 

**2.หลังจากปล่อย Product ออกไปแล้ว**

เพื่อหาจุดที่ทีมสามารถออก Feature ใหม่ ๆ เพื่อให้ตอบโจทย์ประสบการณ์การของ User มากขึ้น

>โดยสรุปก็คือ User Journey เป็นประโยชน์กับการพัฒนา Product แทบจะทุกขั้นตอนเลย

---

## องค์ประกอบของ User Journey มีอะไรบ้าง
จากที่เห็นไปข้างต้น เราใช้คำว่า “ภาพใหญ่” เพราะมันคือภาพใหญ่จริง ๆ เพราะเราจะไม่ลงลึกในรายละเอียดของพฤติกรรมที่ User มีต่อแต่ละหน้าของ Product แต่เราจะแบ่ง Journey ออกเป็น Stage หรือเป็นขั้น ๆ โดยมีส่วนประกอบตามนี้


[![05-UX-User-Journey.png](https://i.postimg.cc/DZtDJxs8/05-UX-User-Journey.png)](https://postimg.cc/KkDQCr02)

**1.Stage หรือ ลำดับขั้น**

ใช้เพื่อแสดงถึงภาพกว้าง ๆ ว่าในขั้นนี้ User ของเรากำลังทำอะไร ที่นิยมใช้กับก็จะมี Awareness / Consideration / Decision making ฯลฯ ซึ่ง Stage นี้จะไม่มีสูตรสำเร็จ เพื่อน ๆ สามารถปรับให้สอดคล้องกับ Product ของตัวเองได้เลย

**2.Goal หรือ เป้าหมาย**

เพื่อให้ทีมเห็นภาพว่า ในแต่ละขั้น เป้าหมายของ User คืออะไร หรือ User ต้องการที่จะทำอะไรให้สำเร็จ

**3.Thinking หรือ ความคิด**

จากเป้าหมายที่ User มี เราต้องรู้ว่าเขามีความคิดอะไร มี Pain หรือ Need อะไรในแต่ละขั้น

**4.Action หรือ สิ่งที่ลงมือทำ**

User ลงมือทำอะไร เพื่อให้บรรลุเป้าหมาย

**5.Emotion หรือ อารมณ์**

อารมณ์ในแต่ละขั้นเป็นอย่างไร เป็นทางบวก หรือทางลบ


>จะเห็นว่าข้อมูลทั้งหมดนี้ จะช่วยให้ทีม Product เห็นภาพของ User ชัดมากขึ้นว่าในแต่ละขั้นที่ User ของเรามีปฏิสัมพันธ์กับ Product เขามีปัญหา หรือมีความต้องการอะไรซ่อนอยู่ ซึ่งเราในฐานะทีม Product จะได้เห็นแนวทางการพัฒนา Product ให้ตอบโจทย์ User มากขึ้นนั่นเอง
-  -   -  - 

### แล้วจะสร้าง User Journey ขึ้นมาได้ยังไง?

1.สร้างขึ้นมาเอง 

ในกรณีที่ทีมไม่มีงบประมาณหรือไม่มีเวลาในการออไปทำ Research ก็สามารถเริ่มจากการสมมติจาก User Persona ขึ้นมาก็ได้ว่า ถ้าคน Persona แบบนี้มีเขาจะมี Interact กับ Product อย่างไรบ้าง

2.ออกไปเก็บข้อมูล 

หรือก็คือการออกไป Research โดยใช้ Quan + Quali เหมือนเดิมเลย ซึ่งแน่นอนว่าวิธีการเก็บข้อมูลส่วนหนึ่งนั้นก็ขึ้นอยู่กับงบประมาณและเวลาที่ทีมงานมีอยู่


ต่อมาเราก็พร้อมที่จะออกไปทำ Research และเริ่มลงมือทำ User Journey ได้เลย !

- - -
 
มาดูตัวอย่างกัน 


>เพื่อน ๆ อยู่ในทีม Digital learning product ที่กำลังพัฒนา Platform เรียนออนไลน์ให้คนวัยทำงาน และกำลังทำ User journey

![u](https://i.ibb.co/w0VzbTP/05-UX-User-Journey-3.png)

---
และนี่คือทั้งหมดเกี่ยวกับการใช้งาน User Journey ใน Digital Product ถ้าใครมีคำถาม หรือต้องการแบ่งข้อมูลเพิ่มเติม สามารถมาแชร์กันได้นะคะ

